import React, { useEffect, useState } from 'react';
import PlacesAutocomplete, { geocodeByAddress, getLatLng } from 'react-places-autocomplete';
import { GoogleMap, MarkerF, Circle } from '@react-google-maps/api';
import { Button, Table, TableBody, TableCell, TableHead, TableRow, Paper, CircularProgress, Box, Container, TextField, Chip, Snackbar } from '@mui/material';


const App = () => {
    const dataObject = {11110515: ['여자45세부터49세생활인구수 (811.89)', '여자40세부터44세생활인구수 (737.12)', '여자35세부터39세생활인구수 (670.17)'], 11110530: ['여자25세부터29세생활인구수 (1657.39)', '여자35세부터39세생활인구수 (1639.44)', '남자35세부터39세생활인구수 (1625.08)'], 11110540: ['남자20세부터24세생활인구수 (371.66)', '남자35세부터39세생활인구수 (353.06)', '남자45세부터49세생활인구수 (342.18)'], 11110550: ['여자45세부터49세생활인구수 (665.17)', '여자50세부터54세생활인구수 (552.75)', '여자40세부터44세생활인구수 (538.33)'], 11110560: ['여자50세부터54세생활인구수 (750.04)', '여자45세부터49세생활인구수 (711.37)', '남자50세부터54세생활인구수 (626.49)'], 11110570: ['여자45세부터49세생활인구수 (331.54)', '여자50세부터54세생활인구수 (262.16)', '여자35세부터39세생활인구수 (247.89)'], 11110580: ['여자45세부터49세생활인구수 (368.36)', '여자35세부터39세생활인구수 (357.32)', '남자45세부터49세생활인구수 (334.86)'], 11110600: ['남자35세부터39세생활인구수 (496.99)', '남자40세부터44세생활인구수 (404.50)', '남자45세부터49세생활인구수 (382.49)'], 11110615: ['남자35세부터39세생활인구수 (4343.90)', '남자45세부터49세생활인구수 (4075.31)', '여자25세부터29세생활인구수 (3920.53)'], 11110630: ['남자45세부터49세생활인구수 (806.30)', '여자25세부터29세생활인구수 (764.23)', '남자35세부터39세생활인구수 (716.32)'], 11110640: ['여자25세부터29세생활인구수 (1892.81)', '여자20세부터24세생활인구수 (1659.69)', '여자35세부터39세생활인구수 (1629.17)'], 11110650: ['여자20세부터24세생활인구수 (3267.43)', '남자20세부터24세생활인구수 (2082.46)', '여자25세부터29세생활인구수 (1752.22)'], 11110670: ['남자35세부터39세생활인구수 (417.89)', '여자50세부터54세생활인구수 (409.06)', '여자45세부터49세생활인구수 (356.62)'], 11110680: ['여자50세부터54세생활인구수 (470.81)', '여자20세부터24세생활인구수 (418.82)', '남자50세부터54세생활인구수 (378.60)'], 11110690: ['여자35세부터39세생활인구수 (198.30)', '남자45세부터49세생활인구수 (191.51)', '남자35세부터39세생활인구수 (179.37)'], 11110700: ['남자35세부터39세생활인구수 (324.60)', '여자50세부터54세생활인구수 (322.42)', '여자35세부터39세생활인구수 (309.56)'], 11110710: ['여자25세부터29세생활인구수 (624.91)', '여자20세부터24세생활인구수 (596.52)', '남자25세부터29세생활인구수 (510.26)'], 11140520: ['남자45세부터49세생활인구수 (2471.75)', '남자35세부터39세생활인구수 (2428.23)', '여자25세부터29세생활인구수 (2401.46)'], 11140540: ['남자35세부터39세생활인구수 (2087.95)', '남자40세부터44세생활인구수 (2049.81)', '남자45세부터49세생활인구수 (1990.38)'], 11140550: ['남자35세부터39세생활인구수 (3535.26)', '남자45세부터49세생활인구수 (3294.94)', '남자40세부터44세생활인구수 (3200.57)'], 11140570: ['여자20세부터24세생활인구수 (825.08)', '남자35세부터39세생활인구수 (752.39)', '남자45세부터49세생활인구수 (722.61)'], 11140580: ['여자20세부터24세생활인구수 (858.96)', '남자20세부터24세생활인구수 (719.23)', '여자25세부터29세생활인구수 (675.86)'], 11140590: ['여자25세부터29세생활인구수 (1596.21)', '남자35세부터39세생활인구수 (1576.96)', '여자35세부터39세생활인구수 (1491.74)'], 11140605: ['남자35세부터39세생활인구수 (1322.82)', '남자45세부터49세생활인구수 (1299.85)', '남자50세부터54세생활인구수 (1263.89)'], 11140615: ['남자35세부터39세생활인구수 (1677.50)', '여자35세부터39세생활인구수 (1421.71)', '남자30세부터34세생활인구수 (1312.18)'], 11140625: ['여자35세부터39세생활인구수 (785.63)', '여자25세부터29세생활인구수 (710.98)', '여자30세부터34세생활인구수 (694.20)'], 11140635: ['여자35세부터39세생활인구수 (725.00)', '남자35세부터39세생활인구수 (591.48)', '남자45세부터49세생활인구수 (573.89)'], 11140645: ['여자35세부터39세생활인구수 (573.17)', '남자35세부터39세생활인구수 (474.37)', '여자30세부터34세생활인구수 (454.22)'], 11140650: ['여자35세부터39세생활인구수 (350.53)', '남자45세부터49세생활인구수 (344.09)', '여자25세부터29세생활인구수 (341.42)'], 11140665: ['여자35세부터39세생활인구수 (493.91)', '남자45세부터49세생활인구수 (467.07)', '남자35세부터39세생활인구수 (420.09)'], 11140670: ['여자35세부터39세생활인구수 (804.69)', '남자35세부터39세생활인구수 (771.58)', '여자25세부터29세생활인구수 (750.54)'], 11140680: ['여자35세부터39세생활인구수 (528.60)', '남자35세부터39세생활인구수 (520.10)', '남자45세부터49세생활인구수 (491.08)'], 11170510: ['남자35세부터39세생활인구수 (657.02)', '여자35세부터39세생활인구수 (615.24)', '남자45세부터49세생활인구수 (571.29)'], 11170520: ['남자35세부터39세생활인구수 (636.12)', '여자30세부터34세생활인구수 (632.44)', '여자35세부터39세생활인구수 (603.99)'], 11170530: ['여자25세부터29세생활인구수 (1146.10)', '남자35세부터39세생활인구수 (1138.80)', '남자45세부터49세생활인구수 (1039.81)'], 11170555: ['여자20세부터24세생활인구수 (1788.52)', '여자25세부터29세생활인구수 (1406.41)', '여자30세부터34세생활인구수 (1033.78)'], 11170560: ['여자35세부터39세생활인구수 (1383.20)', '남자35세부터39세생활인구수 (1306.18)', '여자30세부터34세생활인구수 (1304.20)'], 11170570: ['여자35세부터39세생활인구수 (819.32)', '남자35세부터39세생활인구수 (741.19)', '여자30세부터34세생활인구수 (729.25)'], 11170580: ['여자35세부터39세생활인구수 (414.33)', '여자30세부터34세생활인구수 (408.63)', '여자20세부터24세생활인구수 (401.64)'], 11170590: ['여자35세부터39세생활인구수 (435.69)', '남자35세부터39세생활인구수 (395.78)', '여자30세부터34세생활인구수 (379.50)'], 11170625: ['남자35세부터39세생활인구수 (3410.11)', '여자35세부터39세생활인구수 (3357.87)', '여자25세부터29세생활인구수 (3287.09)'], 11170630: ['여자45세부터49세생활인구수 (1257.76)', '남자45세부터49세생활인구수 (1109.20)', '여자35세부터39세생활인구수 (1101.09)'], 11170640: ['여자35세부터39세생활인구수 (424.95)', '남자35세부터39세생활인구수 (387.87)', '남자40세부터44세생활인구수 (375.44)'], 11170650: ['남자35세부터39세생활인구수 (785.50)', '여자25세부터29세생활인구수 (732.47)', '남자25세부터29세생활인구수 (678.62)'], 11170660: ['여자35세부터39세생활인구수 (684.07)', '남자35세부터39세생활인구수 (654.62)', '여자25세부터29세생활인구수 (620.72)'], 11170685: ['여자35세부터39세생활인구수 (2139.90)', '남자35세부터39세생활인구수 (1985.01)', '여자30세부터34세생활인구수 (1803.86)'], 11170690: ['남자45세부터49세생활인구수 (801.79)', '여자45세부터49세생활인구수 (788.44)', '여자35세부터39세생활인구수 (744.19)'], 11170700: ['남자35세부터39세생활인구수 (573.21)', '남자30세부터34세생활인구수 (498.19)', '남자45세부터49세생활인구수 (493.30)'], 11200520: ['여자35세부터39세생활인구수 (766.22)', '여자25세부터29세생활인구수 (678.34)', '여자30세부터34세생활인구수 (648.57)'], 11200535: ['여자35세부터39세생활인구수 (1523.25)', '여자25세부터29세생활인구수 (1407.20)', '여자20세부터24세생활인구수 (1351.86)'], 11200540: ['여자20세부터24세생활인구수 (929.60)', '남자25세부터29세생활인구수 (918.15)', '남자45세부터49세생활인구수 (916.11)'], 11200550: ['여자20세부터24세생활인구수 (2292.50)', '남자20세부터24세생활인구수 (2149.94)', '남자25세부터29세생활인구수 (2049.63)'], 11200560: ['여자20세부터24세생활인구수 (1376.56)', '여자25세부터29세생활인구수 (1173.42)', '남자25세부터29세생활인구수 (1138.99)'], 11200570: ['여자45세부터49세생활인구수 (910.48)', '여자35세부터39세생활인구수 (907.42)', '여자40세부터44세생활인구수 (817.34)'], 11200580: ['여자45세부터49세생활인구수 (533.02)', '여자35세부터39세생활인구수 (520.21)', '여자40세부터44세생활인구수 (487.46)'], 11200590: ['여자35세부터39세생활인구수 (826.53)', '여자40세부터44세생활인구수 (764.93)', '여자45세부터49세생활인구수 (659.73)'], 11200615: ['여자35세부터39세생활인구수 (1109.52)', '남자35세부터39세생활인구수 (951.47)', '여자40세부터44세생활인구수 (944.14)'], 11200620: ['여자35세부터39세생활인구수 (708.18)', '남자40세부터44세생활인구수 (568.91)', '남자35세부터39세생활인구수 (567.05)'], 11200645: ['여자35세부터39세생활인구수 (1642.81)', '여자40세부터44세생활인구수 (1298.09)', '남자35세부터39세생활인구수 (1253.82)'], 11200650: ['여자25세부터29세생활인구수 (1155.83)', '남자35세부터39세생활인구수 (1087.32)', '여자35세부터39세생활인구수 (1076.40)'], 11200660: ['여자25세부터29세생활인구수 (1570.14)', '남자35세부터39세생활인구수 (1335.83)', '여자30세부터34세생활인구수 (1333.17)'], 11200670: ['남자35세부터39세생활인구수 (1136.86)', '남자25세부터29세생활인구수 (1004.15)', '여자25세부터29세생활인구수 (954.53)'], 11200690: ['여자25세부터29세생활인구수 (3113.37)', '남자25세부터29세생활인구수 (2497.53)', '남자35세부터39세생활인구수 (2445.83)'], 11200720: ['여자25세부터29세생활인구수 (585.66)', '남자25세부터29세생활인구수 (576.54)', '남자45세부터49세생활인구수 (525.19)'], 11200790: ['여자25세부터29세생활인구수 (1055.87)', '남자50세부터54세생활인구수 (970.32)', '여자20세부터24세생활인구수 (965.66)'], 11215710: ['여자20세부터24세생활인구수 (5236.53)', '여자25세부터29세생활인구수 (3850.29)', '남자20세부터24세생활인구수 (3582.02)'], 11215730: ['여자20세부터24세생활인구수 (1582.36)', '남자25세부터29세생활인구수 (1533.99)', '여자25세부터29세생활인구수 (1519.51)'], 11215740: ['여자25세부터29세생활인구수 (839.40)', '남자30세부터34세생활인구수 (749.47)', '여자30세부터34세생활인구수 (747.69)'], 11215750: ['여자25세부터29세생활인구수 (930.48)', '여자30세부터34세생활인구수 (908.13)', '여자35세부터39세생활인구수 (871.49)'], 11215760: ['여자35세부터39세생활인구수 (653.63)', '여자50세부터54세생활인구수 (617.51)', '남자35세부터39세생활인구수 (612.69)'], 11215770: ['여자35세부터39세생활인구수 (982.55)', '여자50세부터54세생활인구수 (920.29)', '여자45세부터49세생활인구수 (895.41)'], 11215780: ['여자25세부터29세생활인구수 (807.75)', '여자30세부터34세생활인구수 (737.23)', '남자25세부터29세생활인구수 (702.07)'], 11215810: ['여자45세부터49세생활인구수 (2063.76)', '여자15세부터19세생활인구수 (1668.06)', '여자40세부터44세생활인구수 (1634.75)'], 11215820: ['여자25세부터29세생활인구수 (1504.05)', '남자25세부터29세생활인구수 (1221.94)', '여자30세부터34세생활인구수 (1127.54)'], 11215830: ['여자35세부터39세생활인구수 (949.53)', '남자45세부터49세생활인구수 (933.33)', '남자35세부터39세생활인구수 (896.43)'], 11215840: ['여자35세부터39세생활인구수 (1208.61)', '여자45세부터49세생활인구수 (1082.50)', '여자40세부터44세생활인구수 (1063.29)'], 11215847: ['여자20세부터24세생활인구수 (1571.61)', '여자25세부터29세생활인구수 (1450.94)', '여자35세부터39세생활인구수 (1287.12)'], 11215850: ['여자25세부터29세생활인구수 (1350.88)', '남자25세부터29세생활인구수 (1140.19)', '여자35세부터39세생활인구수 (1069.79)'], 11215860: ['여자40세부터44세생활인구수 (811.70)', '여자45세부터49세생활인구수 (801.44)', '여자35세부터39세생활인구수 (771.96)'], 11215870: ['여자45세부터49세생활인구수 (1512.51)', '여자35세부터39세생활인구수 (1346.30)', '남자45세부터49세생활인구수 (1254.76)'], 11230536: ['여자20세부터24세생활인구수 (2149.96)', '여자25세부터29세생활인구수 (2116.21)', '남자35세부터39세생활인구수 (1910.99)'], 11230545: ['여자20세부터24세생활인구수 (1948.82)', '남자20세부터24세생활인구수 (1461.37)', '남자25세부터29세생활인구수 (1354.22)'], 11230560: ['여자20세부터24세생활인구수 (1594.20)', '남자20세부터24세생활인구수 (1363.01)', '남자25세부터29세생활인구수 (1320.07)'], 11230570: ['여자20세부터24세생활인구수 (638.73)', '여자45세부터49세생활인구수 (603.50)', '남자20세부터24세생활인구수 (587.73)'], 11230600: ['여자35세부터39세생활인구수 (1129.93)', '남자45세부터49세생활인구수 (977.50)', '여자40세부터44세생활인구수 (964.01)'], 11230610: ['남자35세부터39세생활인구수 (912.08)', '여자35세부터39세생활인구수 (883.24)', '남자45세부터49세생활인구수 (866.76)'], 11230650: ['남자35세부터39세생활인구수 (1915.17)', '남자45세부터49세생활인구수 (1723.50)', '여자35세부터39세생활인구수 (1699.98)'], 11230660: ['여자35세부터39세생활인구수 (1329.23)', '남자45세부터49세생활인구수 (1250.14)', '여자40세부터44세생활인구수 (1232.80)'], 11230705: ['여자20세부터24세생활인구수 (840.48)', '여자50세부터54세생활인구수 (790.48)', '여자25세부터29세생활인구수 (753.21)'], 11230710: ['여자20세부터24세생활인구수 (2224.04)', '남자20세부터24세생활인구수 (1350.13)', '여자25세부터29세생활인구수 (1297.29)'], 11230720: ['여자20세부터24세생활인구수 (1672.88)', '남자20세부터24세생활인구수 (1026.82)', '여자25세부터29세생활인구수 (1004.28)'], 11230730: ['여자20세부터24세생활인구수 (1399.98)', '남자20세부터24세생활인구수 (1038.38)', '남자25세부터29세생활인구수 (990.44)'], 11230740: ['여자20세부터24세생활인구수 (3100.17)', '남자20세부터24세생활인구수 (1870.06)', '남자25세부터29세생활인구수 (1577.00)'], 11230750: ['남자45세부터49세생활인구수 (629.03)', '남자40세부터44세생활인구수 (543.70)', '여자50세부터54세생활인구수 (539.25)'], 11260520: ['남자45세부터49세생활인구수 (841.32)', '여자45세부터49세생활인구수 (835.08)', '여자50세부터54세생활인구수 (804.13)'], 11260540: ['남자45세부터49세생활인구수 (632.25)', '여자45세부터49세생활인구수 (629.47)', '여자35세부터39세생활인구수 (627.30)'], 11260550: ['여자35세부터39세생활인구수 (542.28)', '여자40세부터44세생활인구수 (475.95)', '남자40세부터44세생활인구수 (459.42)'], 11260565: ['여자50세부터54세생활인구수 (1173.05)', '여자25세부터29세생활인구수 (1105.55)', '여자30세부터34세생활인구수 (1080.10)'], 11260570: ['여자50세부터54세생활인구수 (738.02)', '여자35세부터39세생활인구수 (724.98)', '남자35세부터39세생활인구수 (661.51)'], 11260575: ['여자50세부터54세생활인구수 (804.43)', '여자45세부터49세생활인구수 (788.29)', '여자25세부터29세생활인구수 (778.51)'], 11260580: ['여자35세부터39세생활인구수 (722.57)', '여자50세부터54세생활인구수 (652.73)', '여자25세부터29세생활인구수 (628.14)'], 11260590: ['여자25세부터29세생활인구수 (1538.32)', '여자30세부터34세생활인구수 (1354.51)', '여자35세부터39세생활인구수 (1326.97)'], 11260600: ['여자45세부터49세생활인구수 (559.31)', '여자50세부터54세생활인구수 (543.14)', '남자35세부터39세생활인구수 (533.78)'], 11260610: ['여자35세부터39세생활인구수 (1069.34)', '남자35세부터39세생활인구수 (1012.09)', '여자45세부터49세생활인구수 (1000.61)'], 11260620: ['여자45세부터49세생활인구수 (1016.89)', '여자35세부터39세생활인구수 (1006.52)', '여자50세부터54세생활인구수 (956.82)'], 11260630: ['남자35세부터39세생활인구수 (778.64)', '여자50세부터54세생활인구수 (748.09)', '여자35세부터39세생활인구수 (730.67)'], 11260655: ['여자35세부터39세생활인구수 (1769.22)', '남자35세부터39세생활인구수 (1572.62)', '여자40세부터44세생활인구수 (1527.73)'], 11260660: ['여자50세부터54세생활인구수 (496.24)', '남자50세부터54세생활인구수 (428.69)', '여자35세부터39세생활인구수 (421.42)'], 11260680: ['남자45세부터49세생활인구수 (1323.60)', '여자35세부터39세생활인구수 (1307.86)', '여자45세부터49세생활인구수 (1274.11)'], 11260690: ['여자45세부터49세생활인구수 (728.05)', '여자50세부터54세생활인구수 (713.12)', '여자35세부터39세생활인구수 (707.59)'], 11290525: ['여자50세부터54세생활인구수 (859.46)', '여자45세부터49세생활인구수 (859.39)', '여자35세부터39세생활인구수 (818.64)'], 11290555: ['여자20세부터24세생활인구수 (1668.76)', '여자25세부터29세생활인구수 (1180.42)', '여자35세부터39세생활인구수 (1135.05)'], 11290575: ['여자20세부터24세생활인구수 (2523.53)', '여자25세부터29세생활인구수 (1468.78)', '여자15세부터19세생활인구수 (1230.89)'], 11290580: ['여자45세부터49세생활인구수 (530.19)', '여자50세부터54세생활인구수 (497.80)', '남자45세부터49세생활인구수 (445.46)'], 11290590: ['여자45세부터49세생활인구수 (667.61)', '여자50세부터54세생활인구수 (641.05)', '여자40세부터44세생활인구수 (564.58)'], 11290600: ['여자20세부터24세생활인구수 (2722.35)', '남자20세부터24세생활인구수 (2429.78)', '남자25세부터29세생활인구수 (2150.23)'], 11290610: ['여자20세부터24세생활인구수 (739.90)', '여자25세부터29세생활인구수 (719.17)', '남자25세부터29세생활인구수 (637.64)'], 11290620: ['여자45세부터49세생활인구수 (655.37)', '여자40세부터44세생활인구수 (613.44)', '여자50세부터54세생활인구수 (580.13)'], 11290630: ['여자50세부터54세생활인구수 (822.70)', '여자20세부터24세생활인구수 (753.16)', '여자35세부터39세생활인구수 (742.47)'], 11290640: ['여자20세부터24세생활인구수 (1398.58)', '남자20세부터24세생활인구수 (1310.60)', '남자25세부터29세생활인구수 (853.99)'], 11290650: ['여자45세부터49세생활인구수 (739.29)', '여자20세부터24세생활인구수 (714.18)', '여자35세부터39세생활인구수 (694.36)'], 11290660: ['여자45세부터49세생활인구수 (1971.12)', '여자40세부터44세생활인구수 (1723.30)', '남자45세부터49세생활인구수 (1520.51)'], 11290685: ['여자45세부터49세생활인구수 (986.17)', '여자40세부터44세생활인구수 (886.27)', '여자35세부터39세생활인구수 (828.49)'], 11290705: ['여자20세부터24세생활인구수 (2020.34)', '여자45세부터49세생활인구수 (1554.59)', '남자20세부터24세생활인구수 (1532.22)'], 11290715: ['여자35세부터39세생활인구수 (1082.09)', '여자50세부터54세생활인구수 (1073.65)', '여자45세부터49세생활인구수 (1068.80)'], 11290725: ['여자20세부터24세생활인구수 (1241.23)', '여자25세부터29세생활인구수 (923.24)', '남자25세부터29세생활인구수 (842.30)'], 11290760: ['여자45세부터49세생활인구수 (950.44)', '여자50세부터54세생활인구수 (906.52)', '여자35세부터39세생활인구수 (867.85)'], 11290770: ['여자50세부터54세생활인구수 (504.82)', '여자45세부터49세생활인구수 (461.09)', '여자20세부터24세생활인구수 (436.97)'], 11290780: ['남자35세부터39세생활인구수 (330.17)', '여자40세부터44세생활인구수 (313.73)', '남자20세부터24세생활인구수 (313.46)'], 11290810: ['여자20세부터24세생활인구수 (1047.37)', '남자50세부터54세생활인구수 (992.57)', '여자45세부터49세생활인구수 (984.01)'], 11305534: ['여자50세부터54세생활인구수 (890.12)', '여자45세부터49세생활인구수 (869.95)', '남자45세부터49세생활인구수 (841.92)'], 11305535: ['여자20세부터24세생활인구수 (1242.65)', '남자25세부터29세생활인구수 (1043.03)', '여자25세부터29세생활인구수 (985.53)'], 11305545: ['여자45세부터49세생활인구수 (1497.56)', '여자50세부터54세생활인구수 (1457.65)', '여자35세부터39세생활인구수 (1354.72)'], 11305555: ['여자50세부터54세생활인구수 (1112.67)', '여자45세부터49세생활인구수 (1073.64)', '남자50세부터54세생활인구수 (993.91)'], 11305575: ['여자45세부터49세생활인구수 (1058.75)', '여자50세부터54세생활인구수 (850.34)', '여자40세부터44세생활인구수 (843.08)'], 11305590: ['남자25세부터29세생활인구수 (958.00)', '여자20세부터24세생활인구수 (865.97)', '여자25세부터29세생활인구수 (792.41)'], 11305600: ['남자45세부터49세생활인구수 (462.16)', '여자50세부터54세생활인구수 (460.73)', '여자45세부터49세생활인구수 (452.49)'], 11305606: ['여자45세부터49세생활인구수 (641.65)', '여자50세부터54세생활인구수 (602.44)', '남자45세부터49세생활인구수 (563.28)'], 11305610: ['여자50세부터54세생활인구수 (675.95)', '남자25세부터29세생활인구수 (652.55)', '남자45세부터49세생활인구수 (627.63)'], 11305620: ['여자50세부터54세생활인구수 (714.90)', '여자45세부터49세생활인구수 (714.50)', '남자45세부터49세생활인구수 (600.02)'], 11305630: ['여자20세부터24세생활인구수 (1576.04)', '남자25세부터29세생활인구수 (1490.88)', '여자25세부터29세생활인구수 (1382.24)'], 11305645: ['여자20세부터24세생활인구수 (773.95)', '여자50세부터54세생활인구수 (758.02)', '여자35세부터39세생활인구수 (708.02)'], 11305660: ['여자50세부터54세생활인구수 (1003.23)', '여자45세부터49세생활인구수 (975.24)', '남자45세부터49세생활인구수 (917.14)'], 11320511: ['여자45세부터49세생활인구수 (840.50)', '남자45세부터49세생활인구수 (804.57)', '여자50세부터54세생활인구수 (804.14)'], 11320512: ['여자35세부터39세생활인구수 (1172.49)', '여자50세부터54세생활인구수 (1118.21)', '남자45세부터49세생활인구수 (1105.70)'], 11320513: ['여자45세부터49세생활인구수 (452.37)', '여자50세부터54세생활인구수 (408.14)', '남자50세부터54세생활인구수 (383.54)'], 11320514: ['여자50세부터54세생활인구수 (1198.03)', '여자45세부터49세생활인구수 (1101.71)', '남자50세부터54세생활인구수 (1057.23)'], 11320515: ['여자50세부터54세생활인구수 (796.93)', '여자35세부터39세생활인구수 (749.12)', '여자45세부터49세생활인구수 (744.12)'], 11320521: ['남자45세부터49세생활인구수 (711.74)', '여자50세부터54세생활인구수 (674.07)', '남자50세부터54세생활인구수 (661.87)'], 11320522: ['여자50세부터54세생활인구수 (715.38)', '여자45세부터49세생활인구수 (648.86)', '여자35세부터39세생활인구수 (644.16)'], 11320660: ['여자20세부터24세생활인구수 (690.57)', '여자50세부터54세생활인구수 (656.39)', '여자45세부터49세생활인구수 (646.81)'], 11320670: ['여자50세부터54세생활인구수 (712.59)', '남자35세부터39세생활인구수 (627.46)', '여자45세부터49세생활인구수 (625.51)'], 11320680: ['여자25세부터29세생활인구수 (655.92)', '여자50세부터54세생활인구수 (644.33)', '여자45세부터49세생활인구수 (626.17)'], 11320681: ['여자50세부터54세생활인구수 (562.92)', '여자45세부터49세생활인구수 (534.65)', '여자35세부터39세생활인구수 (454.12)'], 11320690: ['여자50세부터54세생활인구수 (998.70)', '여자45세부터49세생활인구수 (921.68)', '남자50세부터54세생활인구수 (887.45)'], 11320700: ['여자45세부터49세생활인구수 (454.15)', '남자50세부터54세생활인구수 (413.96)', '여자50세부터54세생활인구수 (383.53)'], 11320710: ['여자45세부터49세생활인구수 (784.65)', '여자50세부터54세생활인구수 (730.09)', '여자40세부터44세생활인구수 (706.58)'], 11350560: ['남자20세부터24세생활인구수 (1368.60)', '여자20세부터24세생활인구수 (988.63)', '남자25세부터29세생활인구수 (934.17)'], 11350570: ['여자45세부터49세생활인구수 (723.03)', '여자50세부터54세생활인구수 (669.94)', '여자40세부터44세생활인구수 (669.67)'], 11350580: ['여자35세부터39세생활인구수 (929.43)', '여자40세부터44세생활인구수 (892.41)', '남자35세부터39세생활인구수 (883.91)'], 11350595: ['여자20세부터24세생활인구수 (2044.08)', '남자20세부터24세생활인구수 (1857.95)', '남자25세부터29세생활인구수 (1559.25)'], 11350600: ['남자20세부터24세생활인구수 (2674.83)', '여자20세부터24세생활인구수 (2490.49)', '여자45세부터49세생활인구수 (1834.50)'], 11350611: ['여자45세부터49세생활인구수 (1147.72)', '남자20세부터24세생활인구수 (1037.45)', '여자50세부터54세생활인구수 (1016.91)'], 11350612: ['여자45세부터49세생활인구수 (854.45)', '여자50세부터54세생활인구수 (746.50)', '남자45세부터49세생활인구수 (666.88)'], 11350619: ['여자15세부터19세생활인구수 (1694.20)', '여자45세부터49세생활인구수 (1165.73)', '여자50세부터54세생활인구수 (941.19)'], 11350621: ['여자15세부터19세생활인구수 (1855.89)', '여자45세부터49세생활인구수 (1499.41)', '남자45세부터49세생활인구수 (1147.55)'], 11350624: ['여자45세부터49세생활인구수 (779.86)', '여자50세부터54세생활인구수 (742.50)', '남자45세부터49세생활인구수 (563.25)'], 11350625: ['여자45세부터49세생활인구수 (1510.80)', '여자50세부터54세생활인구수 (1371.45)', '남자45세부터49세생활인구수 (1153.00)'], 11350630: ['여자50세부터54세생활인구수 (1478.80)', '여자45세부터49세생활인구수 (1316.56)', '여자40세부터44세생활인구수 (1266.64)'], 11350640: ['여자20세부터24세생활인구수 (1276.80)', '여자45세부터49세생활인구수 (1209.27)', '여자50세부터54세생활인구수 (1193.40)'], 11350665: ['여자50세부터54세생활인구수 (828.70)', '여자45세부터49세생활인구수 (823.34)', '남자50세부터54세생활인구수 (748.62)'], 11350670: ['여자50세부터54세생활인구수 (822.17)', '여자45세부터49세생활인구수 (712.15)', '남자45세부터49세생활인구수 (687.21)'], 11350695: ['여자45세부터49세생활인구수 (2205.68)', '여자50세부터54세생활인구수 (2189.45)', '여자35세부터39세생활인구수 (1905.50)'], 11350700: ['여자35세부터39세생활인구수 (819.61)', '여자45세부터49세생활인구수 (751.04)', '남자35세부터39세생활인구수 (726.74)'], 11350710: ['여자50세부터54세생활인구수 (743.62)', '여자45세부터49세생활인구수 (693.39)', '여자35세부터39세생활인구수 (615.83)'], 11350720: ['여자50세부터54세생활인구수 (521.99)', '여자45세부터49세생활인구수 (506.56)', '여자20세부터24세생활인구수 (504.13)'], 11380510: ['여자35세부터39세생활인구수 (1473.39)', '여자50세부터54세생활인구수 (1383.17)', '여자30세부터34세생활인구수 (1349.97)'], 11380520: ['여자50세부터54세생활인구수 (1107.73)', '여자45세부터49세생활인구수 (1086.96)', '여자35세부터39세생활인구수 (973.28)'], 11380530: ['여자50세부터54세생활인구수 (866.62)', '여자45세부터49세생활인구수 (836.64)', '여자25세부터29세생활인구수 (797.44)'], 11380551: ['여자25세부터29세생활인구수 (785.48)', '남자25세부터29세생활인구수 (775.17)', '여자30세부터34세생활인구수 (743.33)'], 11380552: ['여자45세부터49세생활인구수 (1024.49)', '여자50세부터54세생활인구수 (857.90)', '남자45세부터49세생활인구수 (850.71)'], 11380560: ['여자45세부터49세생활인구수 (981.67)', '여자50세부터54세생활인구수 (942.33)', '여자40세부터44세생활인구수 (912.95)'], 11380570: ['여자35세부터39세생활인구수 (2346.95)', '여자30세부터34세생활인구수 (2196.11)', '여자25세부터29세생활인구수 (2111.34)'], 11380580: ['여자35세부터39세생활인구수 (1122.21)', '여자40세부터44세생활인구수 (1031.87)', '여자45세부터49세생활인구수 (973.53)'], 11380590: ['여자35세부터39세생활인구수 (826.93)', '여자40세부터44세생활인구수 (800.19)', '남자45세부터49세생활인구수 (704.47)'], 11380600: ['여자45세부터49세생활인구수 (1063.02)', '여자35세부터39세생활인구수 (1017.44)', '남자45세부터49세생활인구수 (998.99)'], 11380625: ['여자45세부터49세생활인구수 (1770.88)', '여자35세부터39세생활인구수 (1694.45)', '여자50세부터54세생활인구수 (1664.86)'], 11380631: ['여자45세부터49세생활인구수 (981.24)', '여자50세부터54세생활인구수 (971.94)', '여자35세부터39세생활인구수 (946.92)'], 11380632: ['남자45세부터49세생활인구수 (502.28)', '여자50세부터54세생활인구수 (464.15)', '여자40세부터44세생활인구수 (459.89)'], 11380640: ['여자45세부터49세생활인구수 (616.73)', '여자50세부터54세생활인구수 (606.68)', '여자35세부터39세생활인구수 (605.13)'], 11380650: ['여자35세부터39세생활인구수 (664.02)', '남자45세부터49세생활인구수 (591.56)', '남자35세부터39세생활인구수 (571.50)'], 11380690: ['여자45세부터49세생활인구수 (3042.70)', '여자40세부터44세생활인구수 (2435.05)', '여자35세부터39세생활인구수 (2310.89)'], 11410520: ['여자45세부터49세생활인구수 (714.90)', '여자50세부터54세생활인구수 (680.04)', '남자50세부터54세생활인구수 (635.00)'], 11410555: ['남자35세부터39세생활인구수 (2912.14)', '여자35세부터39세생활인구수 (2877.89)', '남자40세부터44세생활인구수 (2805.64)'], 11410565: ['남자35세부터39세생활인구수 (2602.87)', '남자45세부터49세생활인구수 (2591.32)', '남자40세부터44세생활인구수 (2539.21)'], 11410585: ['여자20세부터24세생활인구수 (8546.81)', '여자25세부터29세생활인구수 (5451.35)', '남자20세부터24세생활인구수 (4058.77)'], 11410615: ['여자20세부터24세생활인구수 (2518.15)', '여자25세부터29세생활인구수 (2170.56)', '남자25세부터29세생활인구수 (2119.65)'], 11410620: ['여자50세부터54세생활인구수 (1068.71)', '여자45세부터49세생활인구수 (1061.38)', '남자45세부터49세생활인구수 (923.85)'], 11410640: ['여자50세부터54세생활인구수 (601.90)', '여자45세부터49세생활인구수 (559.40)', '남자50세부터54세생활인구수 (523.68)'], 11410655: ['여자45세부터49세생활인구수 (466.83)', '여자50세부터54세생활인구수 (428.03)', '여자35세부터39세생활인구수 (404.87)'], 11410660: ['여자50세부터54세생활인구수 (653.31)', '여자35세부터39세생활인구수 (572.90)', '여자40세부터44세생활인구수 (554.44)'], 11410685: ['여자20세부터24세생활인구수 (940.86)', '여자45세부터49세생활인구수 (932.16)', '여자50세부터54세생활인구수 (845.61)'], 11410690: ['남자45세부터49세생활인구수 (337.86)', '여자45세부터49세생활인구수 (333.14)', '여자35세부터39세생활인구수 (326.66)'], 11410700: ['여자20세부터24세생활인구수 (1253.24)', '남자20세부터24세생활인구수 (914.20)', '여자35세부터39세생활인구수 (769.86)'], 11410710: ['여자45세부터49세생활인구수 (670.81)', '여자35세부터39세생활인구수 (631.42)', '남자45세부터49세생활인구수 (624.75)'], 11410720: ['여자35세부터39세생활인구수 (1405.52)', '여자45세부터49세생활인구수 (1395.69)', '여자40세부터44세생활인구수 (1262.96)'], 11440555: ['여자35세부터39세생활인구수 (1639.34)', '여자30세부터34세생활인구수 (1411.41)', '남자35세부터39세생활인구수 (1344.55)'], 11440565: ['여자35세부터39세생활인구수 (1941.95)', '남자35세부터39세생활인구수 (1912.99)', '여자30세부터34세생활인구수 (1889.11)'], 11440585: ['여자35세부터39세생활인구수 (942.06)', '남자35세부터39세생활인구수 (910.94)', '여자30세부터34세생활인구수 (865.99)'], 11440590: ['남자45세부터49세생활인구수 (1367.95)', '남자35세부터39세생활인구수 (1321.82)', '여자35세부터39세생활인구수 (1282.45)'], 11440600: ['여자20세부터24세생활인구수 (2192.37)', '여자25세부터29세생활인구수 (1672.38)', '남자20세부터24세생활인구수 (1451.67)'], 11440610: ['여자45세부터49세생활인구수 (980.63)', '여자35세부터39세생활인구수 (958.88)', '남자45세부터49세생활인구수 (824.94)'], 11440630: ['여자35세부터39세생활인구수 (808.04)', '여자45세부터49세생활인구수 (757.49)', '여자40세부터44세생활인구수 (728.78)'], 11440655: ['여자20세부터24세생활인구수 (2136.90)', '남자20세부터24세생활인구수 (1513.82)', '여자25세부터29세생활인구수 (1487.68)'], 11440660: ['여자20세부터24세생활인구수 (8150.02)', '여자25세부터29세생활인구수 (6733.02)', '남자25세부터29세생활인구수 (5106.68)'], 11440680: ['여자25세부터29세생활인구수 (1738.16)', '여자30세부터34세생활인구수 (1440.85)', '여자35세부터39세생활인구수 (1404.87)'], 11440690: ['여자35세부터39세생활인구수 (1119.33)', '여자25세부터29세생활인구수 (1038.04)', '남자35세부터39세생활인구수 (1014.72)'], 11440700: ['여자35세부터39세생활인구수 (878.88)', '여자45세부터49세생활인구수 (739.89)', '여자30세부터34세생활인구수 (726.83)'], 11440710: ['여자20세부터24세생활인구수 (1348.91)', '여자25세부터29세생활인구수 (1321.62)', '여자30세부터34세생활인구수 (1023.57)'], 11440720: ['여자35세부터39세생활인구수 (1153.48)', '여자25세부터29세생활인구수 (1068.41)', '여자40세부터44세생활인구수 (1028.12)'], 11440730: ['여자30세부터34세생활인구수 (1681.89)', '여자25세부터29세생활인구수 (1672.53)', '여자35세부터39세생활인구수 (1619.08)'], 11440740: ['남자45세부터49세생활인구수 (3462.68)', '여자25세부터29세생활인구수 (3295.77)', '남자35세부터39세생활인구수 (3141.23)'], 11470510: ['여자15세부터19세생활인구수 (2488.88)', '여자45세부터49세생활인구수 (2333.23)', '남자45세부터49세생활인구수 (2067.37)'], 11470520: ['여자30세부터34세생활인구수 (1031.68)', '여자35세부터39세생활인구수 (1014.80)', '여자25세부터29세생활인구수 (988.40)'], 11470530: ['여자35세부터39세생활인구수 (879.77)', '여자45세부터49세생활인구수 (760.39)', '여자30세부터34세생활인구수 (750.71)'], 11470540: ['여자45세부터49세생활인구수 (924.49)', '여자50세부터54세생활인구수 (775.12)', '남자45세부터49세생활인구수 (682.69)'], 11470550: ['여자45세부터49세생활인구수 (2288.96)', '여자15세부터19세생활인구수 (2243.03)', '여자40세부터44세생활인구수 (1745.28)'], 11470560: ['남자45세부터49세생활인구수 (699.47)', '남자35세부터39세생활인구수 (641.00)', '남자40세부터44세생활인구수 (571.78)'], 11470570: ['여자35세부터39세생활인구수 (517.81)', '여자45세부터49세생활인구수 (466.12)', '여자40세부터44세생활인구수 (453.34)'], 11470580: ['남자50세부터54세생활인구수 (532.86)', '남자45세부터49세생활인구수 (525.43)', '남자35세부터39세생활인구수 (493.35)'], 11470590: ['여자35세부터39세생활인구수 (457.73)', '여자40세부터44세생활인구수 (449.97)', '남자45세부터49세생활인구수 (424.38)'], 11470600: ['여자35세부터39세생활인구수 (475.84)', '여자45세부터49세생활인구수 (466.74)', '남자35세부터39세생활인구수 (453.42)'], 11470610: ['여자35세부터39세생활인구수 (218.38)', '남자35세부터39세생활인구수 (210.82)', '여자50세부터54세생활인구수 (205.45)'], 11470611: ['남자45세부터49세생활인구수 (603.61)', '남자35세부터39세생활인구수 (548.37)', '여자45세부터49세생활인구수 (522.84)'], 11470620: ['여자45세부터49세생활인구수 (842.79)', '여자15세부터19세생활인구수 (758.55)', '남자45세부터49세생활인구수 (715.77)'], 11470630: ['여자15세부터19세생활인구수 (752.43)', '여자45세부터49세생활인구수 (746.98)', '여자40세부터44세생활인구수 (680.26)'], 11470640: ['여자45세부터49세생활인구수 (1833.93)', '남자45세부터49세생활인구수 (1730.18)', '여자50세부터54세생활인구수 (1711.95)'], 11470650: ['남자45세부터49세생활인구수 (1394.10)', '여자45세부터49세생활인구수 (1364.96)', '여자35세부터39세생활인구수 (1298.77)'], 11470670: ['여자45세부터49세생활인구수 (1100.54)', '여자15세부터19세생활인구수 (981.33)', '여자40세부터44세생활인구수 (955.67)'], 11470680: ['여자45세부터49세생활인구수 (1077.42)', '여자50세부터54세생활인구수 (837.77)', '여자40세부터44세생활인구수 (833.41)'], 11500510: ['여자35세부터39세생활인구수 (1625.07)', '남자35세부터39세생활인구수 (1512.76)', '여자30세부터34세생활인구수 (1380.83)'], 11500520: ['여자30세부터34세생활인구수 (1578.78)', '여자35세부터39세생활인구수 (1452.20)', '여자25세부터29세생활인구수 (1395.90)'], 11500530: ['여자30세부터34세생활인구수 (690.19)', '여자35세부터39세생활인구수 (659.02)', '여자45세부터49세생활인구수 (622.15)'], 11500535: ['남자35세부터39세생활인구수 (1764.73)', '여자35세부터39세생활인구수 (1746.85)', '여자25세부터29세생활인구수 (1742.46)'], 11500540: ['여자25세부터29세생활인구수 (2441.58)', '여자30세부터34세생활인구수 (2211.90)', '남자35세부터39세생활인구수 (2152.11)'], 11500550: ['여자45세부터49세생활인구수 (509.81)', '남자35세부터39세생활인구수 (505.07)', '여자35세부터39세생활인구수 (502.38)'], 11500560: ['여자30세부터34세생활인구수 (758.50)', '여자45세부터49세생활인구수 (755.67)', '여자40세부터44세생활인구수 (748.84)'], 11500570: ['여자45세부터49세생활인구수 (720.45)', '여자35세부터39세생활인구수 (714.35)', '남자35세부터39세생활인구수 (714.15)'], 11500590: ['여자25세부터29세생활인구수 (1388.04)', '여자30세부터34세생활인구수 (1276.86)', '남자35세부터39세생활인구수 (1274.04)'], 11500591: ['여자25세부터29세생활인구수 (1122.55)', '여자30세부터34세생활인구수 (1052.28)', '여자35세부터39세생활인구수 (946.07)'], 11500593: ['여자35세부터39세생활인구수 (1436.94)', '여자25세부터29세생활인구수 (1421.68)', '여자45세부터49세생활인구수 (1404.78)'], 11500603: ['남자35세부터39세생활인구수 (3752.90)', '여자25세부터29세생활인구수 (3736.43)', '여자30세부터34세생활인구수 (3303.45)'], 11500604: ['여자35세부터39세생활인구수 (778.24)', '여자30세부터34세생활인구수 (740.11)', '남자35세부터39세생활인구수 (711.12)'], 11500605: ['남자35세부터39세생활인구수 (754.57)', '여자35세부터39세생활인구수 (702.61)', '여자30세부터34세생활인구수 (652.58)'], 11500611: ['여자15세부터19세생활인구수 (1682.59)', '남자45세부터49세생활인구수 (1571.96)', '여자45세부터49세생활인구수 (1546.83)'], 11500615: ['여자45세부터49세생활인구수 (1527.94)', '여자40세부터44세생활인구수 (1434.06)', '남자45세부터49세생활인구수 (1415.41)'], 11500620: ['남자35세부터39세생활인구수 (1816.86)', '남자40세부터44세생활인구수 (1794.94)', '남자45세부터49세생활인구수 (1743.28)'], 11500630: ['남자45세부터49세생활인구수 (1504.81)', '여자35세부터39세생활인구수 (1489.67)', '여자45세부터49세생활인구수 (1460.97)'], 11500640: ['남자35세부터39세생활인구수 (1457.72)', '남자45세부터49세생활인구수 (1286.44)', '여자35세부터39세생활인구수 (1255.96)'], 11500641: ['남자35세부터39세생활인구수 (687.91)', '여자35세부터39세생활인구수 (676.20)', '남자40세부터44세생활인구수 (662.15)'], 11530510: ['여자35세부터39세생활인구수 (1784.58)', '여자45세부터49세생활인구수 (1623.60)', '여자40세부터44세생활인구수 (1583.14)'], 11530520: ['남자45세부터49세생활인구수 (724.42)', '여자35세부터39세생활인구수 (710.30)', '남자40세부터44세생활인구수 (640.94)'], 11530530: ['남자45세부터49세생활인구수 (1808.65)', '남자35세부터39세생활인구수 (1671.81)', '남자50세부터54세생활인구수 (1600.35)'], 11530540: ['남자35세부터39세생활인구수 (3453.34)', '여자25세부터29세생활인구수 (3329.87)', '남자30세부터34세생활인구수 (3173.74)'], 11530550: ['남자35세부터39세생활인구수 (886.56)', '남자45세부터49세생활인구수 (883.81)', '남자50세부터54세생활인구수 (876.70)'], 11530560: ['남자35세부터39세생활인구수 (1813.89)', '여자35세부터39세생활인구수 (1799.82)', '여자25세부터29세생활인구수 (1753.35)'], 11530595: ['남자35세부터39세생활인구수 (803.69)', '남자25세부터29세생활인구수 (703.43)', '남자30세부터34세생활인구수 (669.38)'], 11530720: ['여자45세부터49세생활인구수 (961.22)', '남자45세부터49세생활인구수 (952.67)', '남자35세부터39세생활인구수 (929.47)'], 11530730: ['여자45세부터49세생활인구수 (693.69)', '남자45세부터49세생활인구수 (616.80)', '여자50세부터54세생활인구수 (596.11)'], 11530740: ['남자35세부터39세생활인구수 (1257.89)', '남자45세부터49세생활인구수 (1180.56)', '여자30세부터34세생활인구수 (1140.84)'], 11530750: ['여자35세부터39세생활인구수 (993.50)', '남자35세부터39세생활인구수 (987.84)', '여자45세부터49세생활인구수 (970.35)'], 11530760: ['여자45세부터49세생활인구수 (641.49)', '남자45세부터49세생활인구수 (623.22)', '여자35세부터39세생활인구수 (611.84)'], 11530770: ['여자25세부터29세생활인구수 (806.58)', '여자30세부터34세생활인구수 (772.53)', '남자35세부터39세생활인구수 (765.50)'], 11530780: ['여자35세부터39세생활인구수 (2405.51)', '남자45세부터49세생활인구수 (2107.57)', '남자40세부터44세생활인구수 (2013.38)'], 11530790: ['여자45세부터49세생활인구수 (1050.26)', '남자45세부터49세생활인구수 (923.19)', '여자35세부터39세생활인구수 (890.73)'], 11545510: ['남자35세부터39세생활인구수 (5646.46)', '남자25세부터29세생활인구수 (5432.58)', '남자30세부터34세생활인구수 (5329.80)'], 11545610: ['남자35세부터39세생활인구수 (2311.66)', '남자30세부터34세생활인구수 (2067.65)', '여자35세부터39세생활인구수 (1983.82)'], 11545620: ['남자35세부터39세생활인구수 (582.44)', '남자30세부터34세생활인구수 (577.53)', '여자35세부터39세생활인구수 (572.46)'], 11545630: ['여자25세부터29세생활인구수 (894.56)', '남자35세부터39세생활인구수 (855.49)', '남자25세부터29세생활인구수 (781.64)'], 11545640: ['남자35세부터39세생활인구수 (572.89)', '여자35세부터39세생활인구수 (534.10)', '여자45세부터49세생활인구수 (513.87)'], 11545670: ['여자50세부터54세생활인구수 (1147.33)', '여자35세부터39세생활인구수 (1143.36)', '남자45세부터49세생활인구수 (1131.19)'], 11545680: ['여자45세부터49세생활인구수 (658.30)', '여자40세부터44세생활인구수 (543.34)', '여자50세부터54세생활인구수 (520.57)'], 11545690: ['남자45세부터49세생활인구수 (542.83)', '남자50세부터54세생활인구수 (482.52)', '남자40세부터44세생활인구수 (462.84)'], 11545700: ['여자50세부터54세생활인구수 (453.16)', '여자35세부터39세생활인구수 (415.67)', '남자35세부터39세생활인구수 (396.16)'], 11545710: ['남자45세부터49세생활인구수 (471.93)', '남자50세부터54세생활인구수 (468.83)', '여자50세부터54세생활인구수 (468.16)'], 11560515: ['여자25세부터29세생활인구수 (903.38)', '남자25세부터29세생활인구수 (868.28)', '남자35세부터39세생활인구수 (867.46)'], 11560535: ['여자25세부터29세생활인구수 (3745.71)', '여자30세부터34세생활인구수 (3264.69)', '남자30세부터34세생활인구수 (3135.92)'], 11560540: ['남자35세부터39세생활인구수 (8291.31)', '남자40세부터44세생활인구수 (7893.13)', '남자45세부터49세생활인구수 (7417.33)'], 11560550: ['여자25세부터29세생활인구수 (1495.73)', '여자35세부터39세생활인구수 (1416.37)', '여자30세부터34세생활인구수 (1400.18)'], 11560560: ['여자25세부터29세생활인구수 (2401.89)', '여자30세부터34세생활인구수 (2196.66)', '남자35세부터39세생활인구수 (1997.45)'], 11560585: ['여자35세부터39세생활인구수 (669.51)', '남자35세부터39세생활인구수 (662.45)', '여자30세부터34세생활인구수 (640.57)'], 11560605: ['여자35세부터39세생활인구수 (2155.74)', '남자40세부터44세생활인구수 (2125.85)', '남자35세부터39세생활인구수 (2050.47)'], 11560610: ['남자35세부터39세생활인구수 (1243.24)', '여자30세부터34세생활인구수 (1141.34)', '여자35세부터39세생활인구수 (1111.96)'], 11560620: ['남자35세부터39세생활인구수 (1985.28)', '여자30세부터34세생활인구수 (1815.05)', '남자30세부터34세생활인구수 (1721.56)'], 11560630: ['남자25세부터29세생활인구수 (902.14)', '남자30세부터34세생활인구수 (838.26)', '남자35세부터39세생활인구수 (826.06)'], 11560650: ['여자35세부터39세생활인구수 (516.34)', '남자35세부터39세생활인구수 (502.00)', '여자45세부터49세생활인구수 (497.31)'], 11560660: ['남자35세부터39세생활인구수 (345.55)', '여자35세부터39세생활인구수 (337.19)', '남자45세부터49세생활인구수 (325.53)'], 11560670: ['남자35세부터39세생활인구수 (436.18)', '여자35세부터39세생활인구수 (431.73)', '여자45세부터49세생활인구수 (426.36)'], 11560680: ['여자35세부터39세생활인구수 (932.38)', '여자45세부터49세생활인구수 (835.15)', '남자35세부터39세생활인구수 (812.25)'], 11560690: ['여자35세부터39세생활인구수 (846.98)', '여자45세부터49세생활인구수 (758.80)', '남자35세부터39세생활인구수 (687.20)'], 11560700: ['남자35세부터39세생활인구수 (663.03)', '여자50세부터54세생활인구수 (647.84)', '여자45세부터49세생활인구수 (643.81)'], 11560710: ['남자35세부터39세생활인구수 (1055.20)', '남자45세부터49세생활인구수 (994.83)', '남자50세부터54세생활인구수 (964.47)'], 11560720: ['남자35세부터39세생활인구수 (1200.28)', '남자50세부터54세생활인구수 (1121.05)', '남자45세부터49세생활인구수 (1090.48)'], 11590510: ['남자25세부터29세생활인구수 (3112.23)', '여자20세부터24세생활인구수 (2465.40)', '여자25세부터29세생활인구수 (2212.52)'], 11590520: ['남자25세부터29세생활인구수 (1152.55)', '여자20세부터24세생활인구수 (914.73)', '여자25세부터29세생활인구수 (879.80)'], 11590530: ['여자20세부터24세생활인구수 (2837.40)', '남자20세부터24세생활인구수 (2783.56)', '남자25세부터29세생활인구수 (2064.27)'], 11590540: ['여자35세부터39세생활인구수 (876.30)', '여자45세부터49세생활인구수 (870.67)', '남자45세부터49세생활인구수 (847.34)'], 11590550: ['여자25세부터29세생활인구수 (842.08)', '남자25세부터29세생활인구수 (733.87)', '여자30세부터34세생활인구수 (705.48)'], 11590560: ['여자35세부터39세생활인구수 (929.77)', '남자35세부터39세생활인구수 (888.65)', '여자25세부터29세생활인구수 (806.22)'], 11590605: ['여자20세부터24세생활인구수 (2157.15)', '남자20세부터24세생활인구수 (1760.43)', '남자25세부터29세생활인구수 (1463.12)'], 11590620: ['여자25세부터29세생활인구수 (1575.75)', '남자25세부터29세생활인구수 (1370.10)', '여자30세부터34세생활인구수 (1282.15)'], 11590630: ['여자35세부터39세생활인구수 (1355.92)', '여자45세부터49세생활인구수 (1307.84)', '남자35세부터39세생활인구수 (1240.67)'], 11590640: ['여자35세부터39세생활인구수 (861.46)', '여자45세부터49세생활인구수 (780.53)', '남자45세부터49세생활인구수 (717.78)'], 11590650: ['여자25세부터29세생활인구수 (643.22)', '여자30세부터34세생활인구수 (642.48)', '남자25세부터29세생활인구수 (610.61)'], 11590651: ['여자35세부터39세생활인구수 (558.80)', '여자45세부터49세생활인구수 (447.48)', '여자30세부터34세생활인구수 (433.04)'], 11590660: ['여자45세부터49세생활인구수 (1760.73)', '여자25세부터29세생활인구수 (1755.09)', '여자20세부터24세생활인구수 (1710.34)'], 11590670: ['남자45세부터49세생활인구수 (838.08)', '여자45세부터49세생활인구수 (817.12)', '여자35세부터39세생활인구수 (801.95)'], 11590680: ['여자25세부터29세생활인구수 (1261.02)', '남자35세부터39세생활인구수 (1162.79)', '여자35세부터39세생활인구수 (1147.70)'], 11620525: ['여자25세부터29세생활인구수 (1017.48)', '남자25세부터29세생활인구수 (1016.97)', '남자30세부터34세생활인구수 (866.22)'], 11620545: ['여자35세부터39세생활인구수 (546.13)', '여자45세부터49세생활인구수 (494.91)', '남자35세부터39세생활인구수 (448.71)'], 11620565: ['여자45세부터49세생활인구수 (935.60)', '남자45세부터49세생활인구수 (877.50)', '여자40세부터44세생활인구수 (834.95)'], 11620575: ['여자25세부터29세생활인구수 (1699.42)', '남자25세부터29세생활인구수 (1578.99)', '남자30세부터34세생활인구수 (1226.33)'], 11620585: ['여자25세부터29세생활인구수 (2068.06)', '남자25세부터29세생활인구수 (1981.35)', '여자20세부터24세생활인구수 (1907.37)'], 11620595: ['여자25세부터29세생활인구수 (3340.16)', '남자25세부터29세생활인구수 (3253.84)', '여자20세부터24세생활인구수 (2849.56)'], 11620605: ['여자25세부터29세생활인구수 (1377.72)', '남자25세부터29세생활인구수 (1250.45)', '남자30세부터34세생활인구수 (1170.61)'], 11620615: ['여자25세부터29세생활인구수 (1203.70)', '남자25세부터29세생활인구수 (1027.69)', '여자20세부터24세생활인구수 (876.64)'], 11620625: ['여자25세부터29세생활인구수 (1670.04)', '남자25세부터29세생활인구수 (1492.83)', '여자30세부터34세생활인구수 (1215.62)'], 11620630: ['남자20세부터24세생활인구수 (1364.44)', '남자25세부터29세생활인구수 (1258.62)', '여자25세부터29세생활인구수 (1229.59)'], 11620645: ['남자25세부터29세생활인구수 (1875.21)', '여자25세부터29세생활인구수 (1614.67)', '남자30세부터34세생활인구수 (1435.12)'], 11620655: ['남자25세부터29세생활인구수 (1272.22)', '여자25세부터29세생활인구수 (1202.69)', '남자30세부터34세생활인구수 (991.19)'], 11620665: ['남자25세부터29세생활인구수 (1418.68)', '여자25세부터29세생활인구수 (1024.33)', '남자30세부터34세생활인구수 (1019.02)'], 11620685: ['여자25세부터29세생활인구수 (1388.80)', '남자25세부터29세생활인구수 (1323.65)', '여자20세부터24세생활인구수 (1125.49)'], 11620695: ['남자25세부터29세생활인구수 (2813.30)', '여자25세부터29세생활인구수 (2682.79)', '남자30세부터34세생활인구수 (2159.29)'], 11620715: ['남자45세부터49세생활인구수 (485.39)', '여자45세부터49세생활인구수 (484.15)', '여자50세부터54세생활인구수 (427.93)'], 11620725: ['남자35세부터39세생활인구수 (2021.04)', '여자25세부터29세생활인구수 (2004.08)', '남자25세부터29세생활인구수 (1811.75)'], 11620735: ['남자25세부터29세생활인구수 (3706.22)', '남자20세부터24세생활인구수 (2490.20)', '여자25세부터29세생활인구수 (2473.81)'], 11620745: ['남자45세부터49세생활인구수 (814.43)', '남자35세부터39세생활인구수 (782.05)', '여자25세부터29세생활인구수 (761.52)'], 11620765: ['여자45세부터49세생활인구수 (818.19)', '남자45세부터49세생활인구수 (789.97)', '여자25세부터29세생활인구수 (788.39)'], 11620775: ['남자45세부터49세생활인구수 (679.29)', '남자40세부터44세생활인구수 (646.29)', '여자45세부터49세생활인구수 (632.98)'], 11650510: ['남자45세부터49세생활인구수 (1879.88)', '여자35세부터39세생활인구수 (1818.17)', '남자35세부터39세생활인구수 (1763.57)'], 11650520: ['남자35세부터39세생활인구수 (3326.58)', '여자25세부터29세생활인구수 (3274.22)', '남자45세부터49세생활인구수 (3223.90)'], 11650530: ['남자45세부터49세생활인구수 (4143.74)', '남자35세부터39세생활인구수 (3855.91)', '여자25세부터29세생활인구수 (3684.16)'], 11650531: ['여자20세부터24세생활인구수 (2748.11)', '여자25세부터29세생활인구수 (2734.95)', '남자45세부터49세생활인구수 (2200.81)'], 11650540: ['남자45세부터49세생활인구수 (1913.78)', '여자45세부터49세생활인구수 (1701.06)', '남자40세부터44세생활인구수 (1602.78)'], 11650550: ['남자45세부터49세생활인구수 (251.65)', '남자50세부터54세생활인구수 (221.47)', '여자45세부터49세생활인구수 (207.34)'], 11650560: ['여자35세부터39세생활인구수 (1759.41)', '남자45세부터49세생활인구수 (1711.54)', '남자35세부터39세생활인구수 (1675.21)'], 11650570: ['여자45세부터49세생활인구수 (883.81)', '남자45세부터49세생활인구수 (855.91)', '여자15세부터19세생활인구수 (796.34)'], 11650580: ['여자45세부터49세생활인구수 (1538.12)', '여자50세부터54세생활인구수 (1136.03)', '남자45세부터49세생활인구수 (1124.69)'], 11650581: ['여자45세부터49세생활인구수 (2482.42)', '여자40세부터44세생활인구수 (2195.53)', '여자35세부터39세생활인구수 (2180.58)'], 11650590: ['여자45세부터49세생활인구수 (1008.38)', '남자45세부터49세생활인구수 (804.45)', '여자40세부터44세생활인구수 (725.86)'], 11650600: ['여자35세부터39세생활인구수 (1072.46)', '여자45세부터49세생활인구수 (909.80)', '남자45세부터49세생활인구수 (895.43)'], 11650610: ['여자25세부터29세생활인구수 (990.69)', '남자35세부터39세생활인구수 (953.11)', '여자30세부터34세생활인구수 (937.07)'], 11650620: ['여자35세부터39세생활인구수 (800.60)', '여자45세부터49세생활인구수 (777.62)', '남자45세부터49세생활인구수 (767.46)'], 11650621: ['여자45세부터49세생활인구수 (1402.33)', '남자45세부터49세생활인구수 (1248.99)', '여자40세부터44세생활인구수 (1208.75)'], 11650651: ['남자45세부터49세생활인구수 (3496.43)', '남자35세부터39세생활인구수 (3370.97)', '남자40세부터44세생활인구수 (3020.02)'], 11650652: ['남자35세부터39세생활인구수 (2767.56)', '남자45세부터49세생활인구수 (2494.66)', '남자40세부터44세생활인구수 (2458.12)'], 11650660: ['남자45세부터49세생활인구수 (1474.62)', '남자40세부터44세생활인구수 (1150.91)', '여자40세부터44세생활인구수 (1058.64)'], 11680510: ['여자25세부터29세생활인구수 (2531.89)', '여자35세부터39세생활인구수 (2203.35)', '여자30세부터34세생활인구수 (2180.22)'], 11680521: ['여자25세부터29세생활인구수 (4048.47)', '여자30세부터34세생활인구수 (3385.87)', '남자35세부터39세생활인구수 (3268.73)'], 11680531: ['여자25세부터29세생활인구수 (3958.34)', '남자35세부터39세생활인구수 (3704.83)', '여자30세부터34세생활인구수 (3540.03)'], 11680545: ['여자25세부터29세생활인구수 (2586.26)', '여자35세부터39세생활인구수 (2426.95)', '여자30세부터34세생활인구수 (2331.50)'], 11680565: ['여자35세부터39세생활인구수 (2763.98)', '여자25세부터29세생활인구수 (2629.20)', '남자35세부터39세생활인구수 (2477.78)'], 11680580: ['남자35세부터39세생활인구수 (3259.08)', '남자40세부터44세생활인구수 (3141.16)', '여자25세부터29세생활인구수 (3103.28)'], 11680590: ['남자45세부터49세생활인구수 (2603.22)', '남자35세부터39세생활인구수 (2549.05)', '여자25세부터29세생활인구수 (2547.80)'], 11680600: ['여자15세부터19세생활인구수 (3063.16)', '여자45세부터49세생활인구수 (1941.95)', '여자40세부터44세생활인구수 (1320.49)'], 11680610: ['여자15세부터19세생활인구수 (3047.71)', '남자45세부터49세생활인구수 (2849.82)', '여자45세부터49세생활인구수 (2816.56)'], 11680630: ['여자15세부터19세생활인구수 (4252.22)', '여자45세부터49세생활인구수 (2269.36)', '남자45세부터49세생활인구수 (2124.55)'], 11680640: ['여자25세부터29세생활인구수 (10320.01)', '남자35세부터39세생활인구수 (9516.25)', '여자30세부터34세생활인구수 (8911.21)'], 11680650: ['남자45세부터49세생활인구수 (3390.01)', '여자45세부터49세생활인구수 (3283.93)', '여자25세부터29세생활인구수 (3253.20)'], 11680655: ['남자45세부터49세생활인구수 (1880.69)', '여자45세부터49세생활인구수 (1865.27)', '여자35세부터39세생활인구수 (1755.63)'], 11680656: ['여자45세부터49세생활인구수 (1796.27)', '남자45세부터49세생활인구수 (1474.94)', '여자40세부터44세생활인구수 (1450.48)'], 11680660: ['여자45세부터49세생활인구수 (462.12)', '남자45세부터49세생활인구수 (455.24)', '여자40세부터44세생활인구수 (403.09)'], 11680670: ['여자45세부터49세생활인구수 (1861.47)', '여자40세부터44세생활인구수 (1612.97)', '남자45세부터49세생활인구수 (1441.30)'], 11680690: ['여자45세부터49세생활인구수 (766.55)', '남자35세부터39세생활인구수 (744.46)', '남자50세부터54세생활인구수 (711.23)'], 11680700: ['여자40세부터44세생활인구수 (2141.63)', '여자35세부터39세생활인구수 (1962.43)', '여자45세부터49세생활인구수 (1838.45)'], 11680720: ['여자45세부터49세생활인구수 (1320.11)', '여자40세부터44세생활인구수 (1135.18)', '여자50세부터54세생활인구수 (1021.46)'], 11680730: ['남자45세부터49세생활인구수 (769.12)', '남자35세부터39세생활인구수 (672.51)', '여자45세부터49세생활인구수 (670.14)'], 11680740: ['여자45세부터49세생활인구수 (816.91)', '남자45세부터49세생활인구수 (782.48)', '여자35세부터39세생활인구수 (725.23)'], 11680750: ['남자45세부터49세생활인구수 (1202.95)', '남자35세부터39세생활인구수 (1168.89)', '남자40세부터44세생활인구수 (1111.56)'], 11710510: ['여자35세부터39세생활인구수 (586.90)', '여자45세부터49세생활인구수 (583.67)', '남자35세부터39세생활인구수 (573.24)'], 11710520: ['여자45세부터49세생활인구수 (2022.87)', '여자35세부터39세생활인구수 (1942.20)', '여자25세부터29세생활인구수 (1857.07)'], 11710531: ['여자50세부터54세생활인구수 (494.18)', '여자45세부터49세생활인구수 (486.50)', '여자35세부터39세생활인구수 (470.25)'], 11710532: ['여자35세부터39세생활인구수 (785.60)', '여자45세부터49세생활인구수 (771.37)', '여자50세부터54세생활인구수 (718.42)'], 11710540: ['여자50세부터54세생활인구수 (483.60)', '남자45세부터49세생활인구수 (466.95)', '여자45세부터49세생활인구수 (460.76)'], 11710550: ['여자50세부터54세생활인구수 (604.14)', '남자45세부터49세생활인구수 (546.45)', '남자50세부터54세생활인구수 (504.83)'], 11710561: ['여자15세부터19세생활인구수 (910.72)', '여자45세부터49세생활인구수 (773.11)', '여자40세부터44세생활인구수 (706.78)'], 11710562: ['여자25세부터29세생활인구수 (2267.21)', '남자35세부터39세생활인구수 (2224.39)', '여자30세부터34세생활인구수 (2161.33)'], 11710566: ['여자40세부터44세생활인구수 (808.37)', '여자45세부터49세생활인구수 (800.93)', '여자35세부터39세생활인구수 (687.09)'], 11710570: ['여자50세부터54세생활인구수 (1517.89)', '여자45세부터49세생활인구수 (1460.52)', '여자35세부터39세생활인구수 (1395.40)'], 11710580: ['여자25세부터29세생활인구수 (1583.93)', '여자30세부터34세생활인구수 (1563.83)', '남자35세부터39세생활인구수 (1419.33)'], 11710590: ['여자35세부터39세생활인구수 (768.29)', '여자40세부터44세생활인구수 (691.85)', '여자45세부터49세생활인구수 (690.10)'], 11710600: ['여자35세부터39세생활인구수 (1543.04)', '여자30세부터34세생활인구수 (1476.20)', '여자25세부터29세생활인구수 (1409.70)'], 11710610: ['여자35세부터39세생활인구수 (1634.80)', '여자30세부터34세생활인구수 (1530.52)', '여자25세부터29세생활인구수 (1463.72)'], 11710620: ['남자35세부터39세생활인구수 (1878.69)', '남자40세부터44세생활인구수 (1697.12)', '여자35세부터39세생활인구수 (1680.64)'], 11710631: ['여자35세부터39세생활인구수 (1685.54)', '남자35세부터39세생활인구수 (1549.68)', '남자40세부터44세생활인구수 (1515.87)'], 11710632: ['여자45세부터49세생활인구수 (1167.27)', '여자50세부터54세생활인구수 (1088.35)', '여자35세부터39세생활인구수 (1066.91)'], 11710641: ['남자35세부터39세생활인구수 (1085.54)', '여자35세부터39세생활인구수 (1049.30)', '여자25세부터29세생활인구수 (985.67)'], 11710642: ['남자35세부터39세생활인구수 (3214.88)', '남자40세부터44세생활인구수 (2906.45)', '남자45세부터49세생활인구수 (2754.09)'], 11710646: ['여자35세부터39세생활인구수 (1587.71)', '남자35세부터39세생활인구수 (1502.34)', '남자45세부터49세생활인구수 (1423.56)'], 11710647: ['여자40세부터44세생활인구수 (2308.20)', '여자35세부터39세생활인구수 (2296.65)', '여자45세부터49세생활인구수 (1845.60)'], 11710650: ['여자35세부터39세생활인구수 (1832.26)', '남자35세부터39세생활인구수 (1789.17)', '여자30세부터34세생활인구수 (1719.03)'], 11710670: ['여자45세부터49세생활인구수 (1680.93)', '남자45세부터49세생활인구수 (1549.70)', '여자40세부터44세생활인구수 (1538.00)'], 11710680: ['여자40세부터44세생활인구수 (2487.85)', '여자35세부터39세생활인구수 (2355.57)', '여자45세부터49세생활인구수 (2301.66)'], 11710690: ['여자40세부터44세생활인구수 (1063.25)', '여자35세부터39세생활인구수 (926.23)', '여자45세부터49세생활인구수 (887.28)'], 11710710: ['여자35세부터39세생활인구수 (2844.88)', '남자35세부터39세생활인구수 (2604.24)', '여자30세부터34세생활인구수 (2585.78)'], 11710720: ['여자45세부터49세생활인구수 (424.81)', '여자40세부터44세생활인구수 (409.59)', '남자45세부터49세생활인구수 (384.99)'], 11740515: ['여자35세부터39세생활인구수 (2482.64)', '여자40세부터44세생활인구수 (2394.27)', '남자45세부터49세생활인구수 (2344.90)'], 11740520: ['여자40세부터44세생활인구수 (2196.67)', '여자35세부터39세생활인구수 (2039.18)', '여자45세부터49세생활인구수 (1792.16)'], 11740530: ['여자45세부터49세생활인구수 (1196.19)', '여자40세부터44세생활인구수 (1107.52)', '여자35세부터39세생활인구수 (1096.54)'], 11740540: ['여자45세부터49세생활인구수 (828.30)', '여자15세부터19세생활인구수 (734.71)', '여자40세부터44세생활인구수 (636.81)'], 11740550: ['여자40세부터44세생활인구수 (1147.25)', '여자45세부터49세생활인구수 (1094.18)', '남자45세부터49세생활인구수 (1020.96)'], 11740560: ['여자35세부터39세생활인구수 (1025.31)', '여자40세부터44세생활인구수 (1019.28)', '여자45세부터49세생활인구수 (1003.48)'], 11740570: ['여자45세부터49세생활인구수 (1148.64)', '여자35세부터39세생활인구수 (1020.64)', '남자35세부터39세생활인구수 (967.87)'], 11740580: ['여자35세부터39세생활인구수 (797.54)', '남자35세부터39세생활인구수 (692.39)', '여자40세부터44세생활인구수 (635.02)'], 11740590: ['여자40세부터44세생활인구수 (671.17)', '여자45세부터49세생활인구수 (670.46)', '남자45세부터49세생활인구수 (600.58)'], 11740600: ['여자35세부터39세생활인구수 (1343.31)', '여자45세부터49세생활인구수 (1315.28)', '남자35세부터39세생활인구수 (1216.62)'], 11740610: ['여자35세부터39세생활인구수 (2104.53)', '남자35세부터39세생활인구수 (2026.17)', '여자30세부터34세생활인구수 (1900.43)'], 11740620: ['여자25세부터29세생활인구수 (1385.04)', '여자30세부터34세생활인구수 (1294.86)', '여자35세부터39세생활인구수 (1202.47)'], 11740640: ['여자45세부터49세생활인구수 (1117.47)', '여자35세부터39세생활인구수 (1086.04)', '남자35세부터39세생활인구수 (1025.26)'], 11740650: ['여자25세부터29세생활인구수 (1161.06)', '여자35세부터39세생활인구수 (1081.13)', '남자35세부터39세생활인구수 (1020.63)'], 11740660: ['남자45세부터49세생활인구수 (1154.77)', '여자45세부터49세생활인구수 (1107.16)', '남자40세부터44세생활인구수 (1087.44)'], 11740685: ['여자45세부터49세생활인구수 (2434.24)', '남자35세부터39세생활인구수 (2334.68)', '여자35세부터39세생활인구수 (2303.61)'], 11740690: ['남자45세부터49세생활인구수 (212.45)', '남자50세부터54세생활인구수 (176.20)', '여자45세부터49세생활인구수 (175.71)'], 11740700: ['여자45세부터49세생활인구수 (1113.93)', '남자35세부터39세생활인구수 (1063.42)', '여자50세부터54세생활인구수 (1036.17)']}

    const allSectors = [
        '중식', '돈까스/회/일식', '양식', '분식', '고기/구이', '족발/보쌈', '치킨', '피자', '버거', '찜/탕/찌개', '백반/죽/국수', '카페/디저트', '아시안', '주점', '샐러드', '도시락/컵밥/토스트'
      ];
    const initialCounts = {};

    allSectors.forEach(
        sector => {initialCounts[sector] = 0;}
    );
      
    const [address, setAddress] = useState("");
    const [coordinates, setCoordinates] = useState({ lat: null, lng: null });
    const [dataLoading, setDataLoading] = useState(false);
    const [apiData, setApiData] = useState(null);
    const [addressCode, setAddressCode] = useState(null);
    const [radius, setRadius] = useState(null);
    const [alertOpen, setAlertOpen] = useState(false);
    const [sectorCounts, setSectorCounts] = useState(initialCounts);
    const [sortedSectors, setSortedSectors] = useState([]);

    const getRadiusValue = (value) => {
        return value === '500m' ? 500 : 
               value === '1km' ? 1000 : 
               value === '2km' ? 2000 : 
               value === '4km' ? 4000 : 6000;
    };

    const handleRadiusClick = (value) => {
        setRadius(getRadiusValue(value));
    };

    const handleSelect = async value => {
        const results = await geocodeByAddress(value);
        const latLng = await getLatLng(results[0]);
        setAddress(value);
        setCoordinates(latLng);
        console.log(String(latLng.lat)+","+String(latLng.lng));
    };

    const handleDragEnd = event => {
        setCoordinates({ lat: event.latLng.lat(), lng: event.latLng.lng() });
        console.log(String(event.latLng.lat())+","+String(event.latLng.lng()));
    };

    const handleButtonClick = async () => {
        if (!radius) {
            setAlertOpen(true);
        } else {
            console.log(String(coordinates.lat)+","+String(coordinates.lng));
            setDataLoading(true);
            try {
                const response = await fetch("https://g32icjuk6rexrsk7iz4pjdtosa0kdorl.lambda-url.ap-northeast-2.on.aws/", {
                    method: 'POST',
                    headers: {
                        'Content-Type': 'application/json'
                    },
                    body: String(coordinates.lat)+","+String(coordinates.lng)+","+String(radius)
                });
        
                if (!response.ok) {
                    throw new Error(`HTTP error! Status: ${response.status}`);
                }
        
                const data = await response.json();
                console.log(data);
                setAddressCode(data.addressCode);
                setApiData(data.list);
                const updatedCounts = { ...initialCounts }; // 초기 카운트 복사
                // apiData를 통해 섹터별 카운트를 업데이트합니다.
                data.list.forEach(place => {
                place.sector.forEach(sector => {
                    updatedCounts[sector]++;
                });
                });

                // 카운트를 업데이트하고 sortedSectors도 재정렬합니다.
                setSectorCounts(updatedCounts);
                setDataLoading(false);
            } catch (error) {
                console.error(error);
            } 
        }
    };

    const handleClose = (event, reason) => {
        if (reason === 'clickaway') {
            return;
        }
        setAlertOpen(false);
    };

    const countBySector = (data) => {
        const counts = {};
    
        data.forEach(item => {
            item.sector.forEach(sector => {
                counts[sector] = (counts[sector] || 0) + 1;
            });
        });
    
        return counts;
    }

    useEffect(() => {
        const sorted = Object.entries(sectorCounts).sort((a, b) => b[1] - a[1]);
        setSortedSectors(sorted);
      }, [sectorCounts]);

    return (
    <Container>
        <Box display="flex" flexDirection="column" alignItems="center" justifyContent="center" height={!coordinates.lat && "100vh"}>
        {!coordinates.lat && <h1 style={{ textAlign: 'center' }}>Sweetspot Recommender</h1>}
        <PlacesAutocomplete 
            value={address} 
            onChange={setAddress}
            onSelect={handleSelect}
        >
            {({ getInputProps, suggestions, getSuggestionItemProps, loading }) => (
                <div style={{ width: '100%', maxWidth: '800px' }}>
                    <TextField 
                        {...getInputProps()} 
                        fullWidth
                        variant="outlined"
                        placeholder="주소를 입력하세요."
                        margin="normal"
                    />
                    <Box mt={1}>
                        {loading && <div>...loading</div>}
                        {suggestions.map(suggestion => {
                            const style = { 
                                backgroundColor: suggestion.active ? "#41b6e6" : "#fff",
                                padding: '5px 10px',
                                cursor: 'pointer'
                            };
                            return (
                                <div key={suggestion.placeId} {...getSuggestionItemProps(suggestion, { style })}>
                                    {suggestion.description}
                                </div>
                            );
                        })}
                    </Box>
                </div>
            )}
        </PlacesAutocomplete>

        {coordinates.lat && coordinates.lng && 
            <GoogleMap 
                mapContainerStyle={{ height: "400px", width: "800px", marginTop: '16px' }}
                zoom={15}
                center={coordinates}
            >
                <MarkerF 
                    position={coordinates} 
                    draggable={true}
                    onDragEnd={handleDragEnd}
                />
                {radius && 
                    <Circle
                        center={coordinates} 
                        radius={radius} 
                        options={{
                            strokeColor: "#FF0000",
                            strokeOpacity: 0.8,
                            strokeWeight: 2,
                            fillColor: "#FF0000",
                            fillOpacity: 0.35,
                        }}
                    />
                }
            </GoogleMap>
        }

        {coordinates.lat && coordinates.lng &&
            <>
                <Box style={{ margin: '16px 0' }}>
                    {['500m', '1km', '2km', '4km', '6km'].map((value) => (
                        <Chip
                            key={value}
                            label={value}
                            onClick={() => handleRadiusClick(value)}
                            color={getRadiusValue(value) === radius ? "primary" : "default"}
                            variant={getRadiusValue(value) === radius ? "filled" : "outlined"}
                            style={{ margin: '0 5px' }}
                        />
                    ))}
                </Box>
                <Button 
                    variant="contained" 
                    color="primary" 
                    onClick={handleButtonClick}
                    style={{ marginTop: '16px', marginBottom: '16px'}}
                >
                    분석 시작하기
                </Button>
                <Snackbar
                    open={alertOpen}
                    autoHideDuration={6000}
                    onClose={handleClose}
                    message="분석하기 전에 반경을 선택해주세요."
                    action={
                        <>
                            <Button color="secondary" size="small" onClick={handleClose}>
                                Close
                            </Button>
                        </>
                    }
                />
            </>}
        {dataLoading && <CircularProgress style={{ marginTop: '16px'}}/>}
        </Box>
        {apiData && !dataLoading && (
    <div style={{ overflowX: 'scroll', display: 'flex', justifyContent: 'center' }}>
        <Paper style={{ minWidth: '70%', margin: '0 10px' }}>
            <h2 style={{ textAlign: 'center' }}>코드: {addressCode}</h2>
            <div>
                {addressCode && dataObject[addressCode] && (
                    <ul>
                    {dataObject[addressCode].map((item, index) => (
                        <li key={index}>{item}</li>
                    ))}
                    </ul>
                )}
            </div>
            <div style={{ marginBottom: '20px', textAlign: 'center' }}>
                    {sortedSectors.map((sector, index) => (
                        <span key={index} style={{ marginRight: '10px' }}>
                            {sector[0]}: {sector[1]}
                        </span>
                    ))}
            </div>
            <h2 style={{ textAlign: 'center' }}>통합 테이블</h2>
            <Table border="1">
                <TableHead>
                    <TableRow>
                        <th>Index</th>
                        <th>Name</th>
                        <th>category_name</th>
                        <th>Distance</th>
                        <th>Sector</th>
                    </TableRow>
                </TableHead>
                <TableBody>
                    {apiData.map((item, index) => (
                        <TableRow key={index}>
                            <TableCell>{index + 1}</TableCell>
                            <TableCell>{item.place_name}</TableCell>
                            <TableCell>{item.category_name}</TableCell>
                            <TableCell>{item.distance}</TableCell>
                            <TableCell>{item.sector.join(', ')}</TableCell>
                        </TableRow>
                    ))}
                </TableBody>
            </Table>
        </Paper>
    </div>
)}

    </Container>
    );
}

export default App;
